{
  "typename": "OrganizationUnitTypes",
  "assembly": "EVA.Core",
  "description": null,
  "usage": {
    "request": true,
    "response": true
  },
  "enumIsFlag": true,
  "typeArguments": [],
  "typeDependencies": [],
  "extends": null,
  "properties": {},
  "enumValues": {
    "B2b": {
      "value": 4096,
      "extends": [],
      "description": "For Business-to-business orders this type can be set. Orders in these organizationunits will be ex-tax."
    },
    "ConcessionStore": {
      "value": 262144,
      "extends": [],
      "description": "An OrganizationUnit representing a Store-In-Store."
    },
    "Consignment": {
      "value": 2048,
      "extends": [
        "Supplier"
      ],
      "description": "Some suppliers deliver their stock in consignment."
    },
    "Container": {
      "value": 4,
      "extends": [],
      "description": "A container is an OrganizationUnit purely used to group some other OrganizationUnits, to allow easier configuration."
    },
    "Country": {
      "value": 32,
      "extends": [
        "Container"
      ],
      "description": "A Country is a special case of the Container type that represents a Country division in the OrganizationUnits structure."
    },
    "DisableLogin": {
      "value": 512,
      "extends": [],
      "description": "OrganizationUnits with DisableLogin cannot be selected in the Login process."
    },
    "EVA": {
      "value": 128,
      "extends": [],
      "description": "The type EVA indicates that the shop is running EVA in the store. This will trigger Tasks etc that will not be generated for Shops that are not (yet) converted to running EVA. P/a non-EVA stores will receive an email for pickupordrs instead of a StockReservationTask."
    },
    "ExternalSupplier": {
      "value": 1024,
      "extends": [],
      "description": "An external supplier is an organization that is not part of your internal organization structure but that you would still like to have available in EVA to for example create purchase Orders for to replenish your warehouse or stores."
    },
    "Franchise": {
      "value": 64,
      "extends": [],
      "description": "A shop can be flagged as franchiser to allow some special flows."
    },
    "Mobile": {
      "value": 131072,
      "extends": [],
      "description": "An OrganizationUnit that is mobile. This indicates that it might have a different address for every financial period."
    },
    "None": {
      "value": 0,
      "extends": [],
      "description": null
    },
    "Pickup": {
      "value": 8,
      "extends": [],
      "description": "Pickup can be combined with type Shop to allow reservation orders in the store."
    },
    "Region": {
      "value": 8192,
      "extends": [
        "Container"
      ],
      "description": "A Region is a special case of the Container type that represents a subdivision under Country OrganizationUnits."
    },
    "RepairCenter": {
      "value": 65536,
      "extends": [],
      "description": "An OrganizationUnit that also does repairs."
    },
    "Restitution": {
      "value": 32768,
      "extends": [],
      "description": "An OrganizationUnit that is meant to be invoiced for restitutions."
    },
    "ReturnsPortal": {
      "value": 16384,
      "extends": [],
      "description": "An OrganizationUnit that is meant to be used by customers for returning Orders."
    },
    "Shop": {
      "value": 1,
      "extends": [],
      "description": "A shop represents a physical store where products can be sold."
    },
    "Supplier": {
      "value": 1024,
      "extends": [],
      "description": "Suppliers are used to replenish warehouses or to export BackOrder/MTO-Products. These OrganizationUnits can have their own set of SupplierProducts, prices and stock."
    },
    "TestOrganizationUnit": {
      "value": 256,
      "extends": [],
      "description": "TestOrganizationUnit can be used to test some things in a production environment. This is not advised :warning:. These stores will be excluded from a lot of processes."
    },
    "Warehouse": {
      "value": 16,
      "extends": [],
      "description": "A warehouse represents an OrganizationUnit where delivery orders can be shipped. The stock of these organizationunits can be made available for delivery orders from (web)shops."
    },
    "WebShop": {
      "value": 2,
      "extends": [],
      "description": "A WebShop represents an online channel that allows delivery and reservation orders, but no carry out sales."
    }
  },
  "parent": null
}